{
    "data": [
        {
            "title": "Should I already search for a room to rent while waiting for my employment pass?",
            "content": "You should secure an Employment Pass or an In-Principle approval from the Ministry of Manpower before renting a property."
        },
        {
            "title": "How long is the lease and is it renewable?",
            "content": "Minimum rental period is 3 months for Private Condominiums, apartments and landed homes, while 6 months for HDB. While the maximum lease is 3 years per application to Singaporecontent or Malaysicontent and 2 years for Non-Singaporecontent and Non-Malaysicontent."
        },
        {
            "title": "Can I sublease the HDB property I'm renting?",
            "content": "Only Singaporean Citizen can sublease, however both Singaporean Citizen and a Singapore Permanent Resident can also sublease so long as it's a 3-bedroom flat or bigger and has an approval from HDB."
        },
        {
            "title": "Can I terminate the lease?",
            "content": "Foreigners can retitlet to add a diplomatic clause in the contract that allows them to terminate the lease after completing a period of 12 months in the event that the Government denied the renewal of their employment pass or work permit."
        },
        {
            "title": "Who pays for the utilities?",
            "content": "The tenant pays for power, water, gas, internet and phone."
        },
        {
            "title": "What should I do if I want to trcontentfer residence after my lease ends?",
            "content": "The tenant should provide 2 months' notice prior to the lease end date."
        },
        {
            "title": "Can my landlord increase rent after a year?",
            "content": "Rent increases usually are executed on the next renewal of lease."
        },
        {
            "title": "What is a Tenancy Agreement (TA)?",
            "content": "It's a contract between the Landlord and Tenant which sets the terms and conditions for the lease of the property."
        },
        {
            "title": "Who pays for the maintenance and repairs?",
            "content": "It should be indicated in the Tenancy Agreement how liable is the tenant for minor repairs from wear and tear. Standard TA requires the tenant to be liable for repairs costing less than $150 and anything more than $150, the tenant should notify the owner since it may no longer be a minor repair."
        },
        {
            "title": "What's an Inventory List?",
            "content": "There is a clause in the Tenancy Agreement requiring an Inventory List which itemizes all furniture, appliances, fixtures, fittings etc. that comes with the property and their conditions which would be subject to repair or replacement after the lease expires."
        },
        {
            "title": "Can my landlord schedule viewing while I'm still renting the property?",
            "content": "Yes, if the tenant has informed the owner that he will not renew the lease. The owner has the right to look for a future Tenant."
        },
        {
            "title": "Who pays for the maintenance of Air-conditioners?",
            "content": "The tenant is responsible for the maintenance such as regular cleaning every 3 month but the owner is responsible for repairs and parts replacement as long as damage is not caused by the tenant's negligence."
        },
        {
            "title": "What is L01?",
            "content": "Letter of Intent (L01) is a document that outlines the fundamental terms of the agreement before they negotiate and finalize all the details."
        },
        {
            "title": "What is a Good Faith Deposit?",
            "content": "Is a down payment made to show the interest in renting the property. After the Tenancy Agreement is signed it is converted as part of the Security deposit. This Good Faith Deposit is not required when using Real-ezy App to do the trcontentaction. Subject to conditions applicable."
        },
        {
            "title": "What is a Security Deposit?",
            "content": "Deposit that will offset any damages or losses caused by the tenant's breach of the Tenancy Agreement. If there's balance left it will be given back to the tenant after the lease has expired. This Security Deposit is not required when using Real-ezy App to do the trcontentaction. Subject to conditions applicable."
        },
        {
            "title": "Can I put wallpaper on the wall of my room?",
            "content": "No, it is not permitted according to HDB Guidelines"
        },
        {
            "title": "Can I sublet my room to my friend?",
            "content": "Tenant in HDB flat is not allowed to sublet his/her room"
        },
        {
            "title": "What is the Problem-Free Period on renting in Singapore?",
            "content": "It is usually part of the Maintenance and Repair clause in the Tenancy Agreement which normally gives the tenant 30 days of assurance that nothing in the premise will be faulty. The landlord will fix any defect and bear all the cost should there be any problems found by the Tenant during the 30day period."
        },
        {
            "title": "What is a Management Committee in a condominium in Singapore?",
            "content": "It is the managing body that controls the property. They are responsible for maintenance and repairs of the building."
        },
        {
            "title": "Can I have pets in my rented HDB property?",
            "content": "You can own one dog (HDB-approved dog breeds) per flat but not cats. Small animals are also allowed just make sure they are not illegally imported animals."
        },
        {
            "title": "Can I have birds in my rented HDB property?",
            "content": "Yes all birds are allowed except from crow, myna, feral pigeons and all birds that are prescribed as protected wildlife species."
        },
        {
            "title": "Can I smoke inside my rented HDB property?",
            "content": "Yes, smoking inside your home is allowed but outside the premises like corridors, stairwells, staircase landings and void decks because they are listed as non-smoking areas."
        },
        {
            "title": "Can I Vape inside my rented HDB property?",
            "content": "No, vaping is illegal in Singapore. Possession, importation, distribution of e-cigarettes or anything that resembles a smoking device is not allowed."
        },
        {
            "title": "Can I smoke Shisha inside my rented HDB property?",
            "content": "No, just like Vape it is banned in Singapore. You are not allowed to buy shisha tobacco abroad and bring it back to Singapore for personal consumption."
        },
        {
            "title": "Can my landlord enter the property anytime?",
            "content": "No, The Tenancy Agreement (TA) should indicate when your landlord can enter the property. Landlords cannot just enter into the property whenever they want, and do \"spot checks\"."
        },
        {
            "title": "Can my landlord increase rent during the lease period?",
            "content": "No, but the landlord would express the intent before the lease expires and will be implementing the increase on the next contract."
        },
        {
            "title": "Can my landlord terminate the lease early?",
            "content": "Yes but the landlord and tenant should give appropriate notice to quit in advance and is subject to terms agreed in the Tenancy Agreement.(TA)."
        },
        {
            "title": "What is CEA?",
            "content": "It stands for Council for Estate Agencies which regulate Singapore's real estate agency industry. It requires all property agents to register through their respective property agencies."
        }
    ]
}
